In [1]:
import pandas as pd

In [2]:
import numpy as np

In [3]:
data =np.random.randn(5,3)

In [4]:
data

array([[-0.32903688, -0.23043165,  0.96219227],
       [-0.35448078,  2.28480657, -0.70414576],
       [-0.54502823, -0.45294435,  0.21667769],
       [-1.50804936,  1.43291645,  0.9551363 ],
       [-0.07421301,  0.19849942,  0.4520555 ]])

In [5]:
dframe = pd.DataFrame(data)

In [6]:
dframe

          0         1         2
0 -0.329037 -0.230432  0.962192
1 -0.354481  2.284807 -0.704146
2 -0.545028 -0.452944  0.216678
3 -1.508049  1.432916  0.955136
4 -0.074213  0.198499  0.452055

In [7]:
type(dframe[0])

pandas.core.series.Series

In [8]:
dframe

          0         1         2
0 -0.329037 -0.230432  0.962192
1 -0.354481  2.284807 -0.704146
2 -0.545028 -0.452944  0.216678
3 -1.508049  1.432916  0.955136
4 -0.074213  0.198499  0.452055

In [9]:
dframe2 = pd.DataFrame(data,index = ["a","b","c","d","e"], columns = ["id","maas","verim"])

In [10]:
dframe2

         id      maas     verim
a -0.329037 -0.230432  0.962192
b -0.354481  2.284807 -0.704146
c -0.545028 -0.452944  0.216678
d -1.508049  1.432916  0.955136
e -0.074213  0.198499  0.452055

In [11]:
dframe2[["maas","id"]]

       maas        id
a -0.230432 -0.329037
b  2.284807 -0.354481
c -0.452944 -0.545028
d  1.432916 -1.508049
e  0.198499 -0.074213

In [12]:
dframe2

         id      maas     verim
a -0.329037 -0.230432  0.962192
b -0.354481  2.284807 -0.704146
c -0.545028 -0.452944  0.216678
d -1.508049  1.432916  0.955136
e -0.074213  0.198499  0.452055

In [13]:
dframe2.loc["d"]

id      -1.508049
maas     1.432916
verim    0.955136
Name: d, dtype: float64

In [14]:
dframe2.iloc[3]

id      -1.508049
maas     1.432916
verim    0.955136
Name: d, dtype: float64

In [15]:
dframe2

         id      maas     verim
a -0.329037 -0.230432  0.962192
b -0.354481  2.284807 -0.704146
c -0.545028 -0.452944  0.216678
d -1.508049  1.432916  0.955136
e -0.074213  0.198499  0.452055

In [16]:
dframe2["yas"] = np.random.randn(5,1)

In [17]:
dframe2

         id      maas     verim       yas
a -0.329037 -0.230432  0.962192  0.629527
b -0.354481  2.284807 -0.704146 -0.649380
c -0.545028 -0.452944  0.216678 -1.246945
d -1.508049  1.432916  0.955136 -0.195371
e -0.074213  0.198499  0.452055  0.736819

In [18]:
dframe2.drop("yas",axis=1)

         id      maas     verim
a -0.329037 -0.230432  0.962192
b -0.354481  2.284807 -0.704146
c -0.545028 -0.452944  0.216678
d -1.508049  1.432916  0.955136
e -0.074213  0.198499  0.452055

In [19]:
dframe2.drop("e",axis=0)

         id      maas     verim       yas
a -0.329037 -0.230432  0.962192  0.629527
b -0.354481  2.284807 -0.704146 -0.649380
c -0.545028 -0.452944  0.216678 -1.246945
d -1.508049  1.432916  0.955136 -0.195371

In [20]:
dframe2

         id      maas     verim       yas
a -0.329037 -0.230432  0.962192  0.629527
b -0.354481  2.284807 -0.704146 -0.649380
c -0.545028 -0.452944  0.216678 -1.246945
d -1.508049  1.432916  0.955136 -0.195371
e -0.074213  0.198499  0.452055  0.736819

In [21]:
dframe2.drop("yas",axis =1 , inplace = True)

In [22]:
dframe2

         id      maas     verim
a -0.329037 -0.230432  0.962192
b -0.354481  2.284807 -0.704146
c -0.545028 -0.452944  0.216678
d -1.508049  1.432916  0.955136
e -0.074213  0.198499  0.452055

In [23]:
dframe2.loc["a"]["maas"]

-0.2304316466376376

In [24]:
dframe2

         id      maas     verim
a -0.329037 -0.230432  0.962192
b -0.354481  2.284807 -0.704146
c -0.545028 -0.452944  0.216678
d -1.508049  1.432916  0.955136
e -0.074213  0.198499  0.452055

In [25]:
dframe2bool=dframe2 < 0

In [26]:
dframe2bool

     id   maas  verim
a  True   True  False
b  True  False   True
c  True   True  False
d  True  False  False
e  True  False  False

In [27]:
dframe2[dframe2bool]

         id      maas     verim
a -0.329037 -0.230432       NaN
b -0.354481       NaN -0.704146
c -0.545028 -0.452944       NaN
d -1.508049       NaN       NaN
e -0.074213       NaN       NaN

In [28]:
dframe2[dframe2 < 0]

         id      maas     verim
a -0.329037 -0.230432       NaN
b -0.354481       NaN -0.704146
c -0.545028 -0.452944       NaN
d -1.508049       NaN       NaN
e -0.074213       NaN       NaN

In [29]:
dframe2[dframe2["maas"] > 0]

         id      maas     verim
b -0.354481  2.284807 -0.704146
d -1.508049  1.432916  0.955136
e -0.074213  0.198499  0.452055

In [30]:
dframe2.reset_index()

  index        id      maas     verim
0     a -0.329037 -0.230432  0.962192
1     b -0.354481  2.284807 -0.704146
2     c -0.545028 -0.452944  0.216678
3     d -1.508049  1.432916  0.955136
4     e -0.074213  0.198499  0.452055

In [31]:
dframe2

         id      maas     verim
a -0.329037 -0.230432  0.962192
b -0.354481  2.284807 -0.704146
c -0.545028 -0.452944  0.216678
d -1.508049  1.432916  0.955136
e -0.074213  0.198499  0.452055

In [32]:
newindekslist = ["num1","num2","num3","num4","num5"]

In [33]:
dframe2["yeni indeks"]=newindekslist

In [34]:
dframe2

         id      maas     verim yeni indeks
a -0.329037 -0.230432  0.962192        num1
b -0.354481  2.284807 -0.704146        num2
c -0.545028 -0.452944  0.216678        num3
d -1.508049  1.432916  0.955136        num4
e -0.074213  0.198499  0.452055        num5

In [35]:
dframe2.set_index("yeni indeks")

                   id      maas     verim
yeni indeks
num1        -0.329037 -0.230432  0.962192
num2        -0.354481  2.284807 -0.704146
num3        -0.545028 -0.452944  0.216678
num4        -1.508049  1.432916  0.955136
num5        -0.074213  0.198499  0.452055

In [36]:
dframe2

         id      maas     verim yeni indeks
a -0.329037 -0.230432  0.962192        num1
b -0.354481  2.284807 -0.704146        num2
c -0.545028 -0.452944  0.216678        num3
d -1.508049  1.432916  0.955136        num4
e -0.074213  0.198499  0.452055        num5

dframe2.set_index("yeni indeks",inplace=True)

In [38]:
dframe2.set_index("yeni indeks",inplace=True)

In [40]:
dframe2

                   id      maas     verim
yeni indeks
num1        -0.329037 -0.230432  0.962192
num2        -0.354481  2.284807 -0.704146
num3        -0.545028 -0.452944  0.216678
num4        -1.508049  1.432916  0.955136
num5        -0.074213  0.198499  0.452055

In [41]:
dframe2.loc["num1"]

id      -0.329037
maas    -0.230432
verim    0.962192
Name: num1, dtype: float64

In [44]:
ilkindeksler = ["fenerbahce","fenerbahce","fenerbahce","besiktas","besiktas","besiktas"]

In [45]:
icindeksler = ["volkan","alex","gokhan","fernando","necip","dembaba"]

In [46]:
birlesmisindeks= list(zip(ilkindeksler,icindeksler))

In [47]:
birlesmisindeks

[('fenerbahce', 'volkan'),
 ('fenerbahce', 'alex'),
 ('fenerbahce', 'gokhan'),
 ('besiktas', 'fernando'),
 ('besiktas', 'necip'),
 ('besiktas', 'dembaba')]

In [48]:
birlesmisindeks = pd.MultiIndex.from_tuples(birlesmisindeks)

In [51]:
birlesmisindeks

MultiIndex([('fenerbahce',   'volkan'),
            ('fenerbahce',     'alex'),
            ('fenerbahce',   'gokhan'),
            (  'besiktas', 'fernando'),
            (  'besiktas',    'necip'),
            (  'besiktas',  'dembaba')],
           )

In [52]:
takimlistesi = [[1,"a"],[2,"b"],[3,"c"],[4,"d"],[5,"e"],[6,"f"]]

In [53]:
takimlistesi

[[1, 'a'], [2, 'b'], [3, 'c'], [4, 'd'], [5, 'e'], [6, 'f']]

In [59]:
takimnumpy = np.array(takimlistesi)

In [60]:
takimdframe = pd.DataFrame(takimnumpy,index=birlesmisindeks,columns=["yas","meslek"])

In [61]:
takimdframe

                    yas meslek
fenerbahce volkan     1      a
           alex       2      b
           gokhan     3      c
besiktas   fernando   4      d
           necip      5      e
           dembaba    6      f

In [63]:
takimdframe.loc["fenerbahce"]

       yas meslek
volkan   1      a
alex     2      b
gokhan   3      c

In [64]:
takimdframe.loc["fenerbahce"].loc["alex"]

yas       2
meslek    b
Name: alex, dtype: object

In [66]:
takimdframe.index.names = ["takim","futbolcu"]

In [67]:
takimdframe

                    yas meslek
takim      futbolcu
fenerbahce volkan     1      a
           alex       2      b
           gokhan     3      c
besiktas   fernando   4      d
           necip      5      e
           dembaba    6      f